Revit 2027 API
Element.GetEntitySchemaGuids Method
 Returns the Schema guids of any Entities stored in this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Guid> GetEntitySchemaGuids()
Public Function GetEntitySchemaGuids As IList(Of Guid)
public:
IList<Guid>^ GetEntitySchemaGuids()
member GetEntitySchemaGuids : unit -> IList<Guid>
Return Value
IList<Guid>
 The schema Entity guids.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace